{
  "title": "Android Fighter",
  "description": {
    "sentences": [
      "Android Fighter is the lowest level coding game that I ever done, it is a one vs one player game and the goal is to kill the opponent.",
      "Without the help of any sort of external APIs or frameworks we had to develop it using direct access to peripherals.",
      "In order to draw the graphics in the screen (we used the \"Dual Buffering\" technic) we had to copy the content of the RAM directly to the VRAM, to move the mouse we had to collect its accelaration data and calculate its position, keyboard inputs were also subscribed and even the datetime displayed in the screen was fetched from the \"Real Time Clock\"."
    ],
    "technologies": [
      "C",
      "Minix"
    ]
  },
  "image": "https://res.cloudinary.com/joaosilva2095/image/upload/f_auto,q_auto/v1511525135/Portfolio/projects/androidfighter_qeedot.jpg",
  "links": [
    {
      "title": "Source code of Android Fighter",
      "link": "https://joaosilva2095.keybase.pub/personal-website/androidfighter.zip",
      "icon": "fa-code-fork"
    }
  ]
},
{
  "title": "Portable Controller",
  "description": {
    "sentences": [
      "We all love gaming controllers such as those from XBox or PlayStation so we thought, why not have one of those in our pocket?",
      "That is the reason why we have created a portable controller that allows a player to play his favourite games using a smartphone.",
      "The controller receptor must be running in the target computer and it allows up to four concurrent connections, that is, four players at the same time.",
      "All a player needs is to connect to the computer using the IP address displayed in the controller receptor."
    ],
    "technologies": [
      "Java",
      "Android"
    ]
  },
  "image": "https://res.cloudinary.com/joaosilva2095/image/upload/f_auto,q_auto/v1511525135/Portfolio/projects/portablecontroller_eqlzpb.jpg",
  "links": [
    {
      "title": "Portable controller Android",
      "link": "https://joaosilva2095.keybase.pub/personal-website/portablecontroller.apk",
      "icon": "fa-android"
    },
    {
      "title": "Portable controller receptor",
      "link": "https://joaosilva2095.keybase.pub/personal-website/portablecontroller.jar",
      "icon": "fa-download"
    }
  ]
}