[
  {
    "title": "UPTEConnect",
    "description": {
      "sentences": [
        "UPTEC is a startup incubator hosting more than 200 start-ups",
        "The management of all the information is very hard and time consuming and this is why a management platform was needed",
        "This platform allows all companies to manage their own collaborators, see the notifications, create requests and more.",
        "Every data stored can be also exported as Excel or PDF"
      ],
      "technologies": [
        "Go",
        "TypeScript",
        "SQL",
        "Angular 4",
        "HTML",
        "CSS"
      ]
    },
    "image": "https://res.cloudinary.com/joaosilva2095/image/upload/f_auto,q_auto/v1511524362/Portfolio/projects/upteconnect_sd313g.png",
    "links": []
  },
  {
    "title": "Cloud Desktops",
    "description": {
      "sentences": [
        "Every day it is more important that the information is accessible from anywhere.",
        "F.J. Seguros wanted that all the 10 employees could work remotely so they could meet with the clients and still have access to everything.",
        "So, a Windows Server machine was configured with Remote Desktop Sessions and all the programs were there installed.",
        "All the documents that were in the office were also moved to the remote machine. All of this was done at the same time employees were working.",
        "To assure the replication of the data, another server (Linux) was configured with OwnCloud to sync all the files from the Windows machine."
      ],
      "technologies": [
        "Windows Server",
        "Linux",
        "OwnCloud"
      ]
    },
    "image": "https://res.cloudinary.com/joaosilva2095/image/upload/f_auto,q_auto/v1511524362/Portfolio/projects/windows_server_k6liil.png",
    "links": []
  },
  {
    "title": "G.A.S. Porto",
    "description": {
      "sentences": [
        "G.A.S. Porto is a social actions group that uses the donations received for organizing events like \"fado\" night, dance and so on.",
        "They have recurring donors, called inside the organization of friends.",
        "I was the lead developer of the online management platform where friends could donate and track their donations.",
        "At the same time administrators of the organization had access to some statistics, like seeing whose friends had committed to donate and had not done it yet, monthly earnings and more."
      ],
      "technologies": [
        "PHP",
        "Smarty",
        "SQL",
        "HTML",
        "CSS"
      ]
    },
    "image": "https://res.cloudinary.com/joaosilva2095/image/upload/f_auto,q_auto/v1519040017/Portfolio/projects/gasporto_jqswo8.png",
    "links": []
  },
  {
    "title": "Minecraft Server",
    "description": {
      "sentences": [
        "In the early beginning of the server I was creating it using plugins that existed in the Internet.",
        "One year after the opening of it I decided to create my own plugins so we could stand out from the crowd.",
        "Several minigames were developed in JAVA, some already known by the players, others that no one ever played because they were 100% unique.",
        "As the server grew we had to balance the load between several physical servers (four Linux servers more specifically). Everything was connected and we used an SQL server to save all the data of the players.",
        "At that time the server was having a huge success! We were 25 people in the team with more than 700 players online playing!"
      ],
      "technologies": [
        "Java",
        "SQL",
        "Batch",
        "Linux"
      ]
    },
    "image": "https://res.cloudinary.com/joaosilva2095/image/upload/f_auto,q_auto/v1511524362/Portfolio/projects/minecraft_team_erkdmj.png",
    "links": [
      {
        "title": "Minecraft Server",
        "link": "https://www.youtube.com/playlist?list=PL721luQ59uVJjnrI2E0pUr4d9We7_JZ0q",
        "icon": "fa-youtube"
      },
      {
        "title": "Minecraft Libraries",
        "link": "https://github.com/joaosilva2095/minecraft-libraries/",
        "icon": "fa-github"
      },
      {
        "title": "Minecraft SkyWars",
        "link": "https://github.com/joaosilva2095/minecraft-skywars/",
        "icon": "fa-github"
      }
    ]
  },
  {
    "title": "Goatie",
    "description": {
      "sentences": [
        "A goat population simulator developed during a 2 day coding hackathon in Porto, Portugal.",
        "It simulates the evolution of a goat population in a random terrain. Gray dots are males, orange dots females and red dots females ready to breed.",
        "The terrain has three biomes: water (no food but high walking speed), plains (medium level of food growth and medium walking speed), mountains (plenty of food but very low walking speed).",
        "The goats desires are: breed if they are not young, eat if it is starving or explore the world if doesn't want to breed or eat.",
        "All the decisions are powered by an artificial intelligence algorithm based on a BDI architecture (beliefs, desires and intentions)."
      ],
      "technologies": [
        "JavaScript",
        "HTML",
        "CSS"
      ]
    },
    "image": "https://res.cloudinary.com/joaosilva2095/image/upload/f_auto,q_auto/v1514905060/Portfolio/projects/goatie_fbilxk.png",
    "links": [
      {
        "title": "Goatie Simulator",
        "link": "https://goatie.joaosilva.co/",
        "icon": "fa-external-link"
      }
    ]
  },
  {
    "title": "ASSIS Mobile",
    "description": {
      "sentences": [
        "ASSIS is an association for social integration. Elderly people are added to the platform and then users can donate to them.",
        "The money received is then used to buy medicines that for being expensive would not otherwise be bought.",
        "With a six people team and a constant communication with the product owner we were able to develop the mobile application and its backend that would built-in the already existing online platform."
      ],
      "technologies": [
        "JavaScript",
        "Java",
        "Ionic"
      ]
    },
    "image": "https://res.cloudinary.com/joaosilva2095/image/upload/f_auto,q_auto/v1511525136/Portfolio/projects/assis_gofqbg.jpg",
    "links": [
      {
        "title": "ASSIS Android",
        "link": "https://joaosilva2095.keybase.pub/personal-website/assis.apk",
        "icon": "fa-android"
      },
      {
        "title": "Promotion video",
        "link": "https://vimeo.com/198324295",
        "icon": "fa-vimeo"
      }
    ]
  },
  {
    "title": "Nidhogg",
    "description": {
      "sentences": [
        "At the beginning we started the development of this project as a clone of the game <b>Nidhogg</b>.",
        "However we changed our minds and developed a \"one vs one\" game where players have to jump between the moving platforms so they do not fall and lose. The last player not to fall wins the game.",
        "This project was developed using JAVA without any framework. All the elements such as buttons, display graphics and sound were custom coded",
        "<b>Controls:</b>",
        "Player 1 - WASD + Space",
        "Player 2 - Arrow Keys + Left Enter"
      ],
      "technologies": [
        "Java"
      ]
    },
    "image": "https://res.cloudinary.com/joaosilva2095/image/upload/f_auto,q_auto/v1511524363/Portfolio/projects/nidhogg_zsteoz.png",
    "links": [
      {
        "title": "Nidhogg game",
        "link": "https://joaosilva2095.keybase.pub/personal-website/nidhogg.jar",
        "icon": "fa-download"
      }
    ]
  },
  {
    "title": "The Maze",
    "description": {
      "sentences": [
        "This is a game where a player is born in a maze and his goal is to find the exit and leave.",
        "However in order to accomplish that, he must kill all the dragons.",
        "They can be killed by throwing the coconuts gathered from the floor to them or with the only sword that exists in the maze.",
        "Dragons shoot fireballs that kill the player if he does not have picked up the shield yet.",
        "The game is fully configurable and we have a hidden feature that is the zoom (that is actually useful when you choose big mazes) that can be controlled with the <b>+</b> and <b>-</b> keys.",
        "You may also save your games for playing them at a later time.",
        "This project was developed using JAVA without any framework. All the elements such as buttons, display graphics and sound were custom coded.",
        "Most of the art used in the game was also created by myself."
      ],
      "technologies": [
        "Java"
      ]
    },
    "image": "https://res.cloudinary.com/joaosilva2095/image/upload/f_auto,q_auto/v1511524363/Portfolio/projects/the_maze_zab6bj.png",
    "links": [
      {
        "title": "The Maze game",
        "link": "https://joaosilva2095.keybase.pub/personal-website/themaze.jar",
        "icon": "fa-download"
      }
    ]
  },
  {
    "title": "Portable Controller",
    "description": {
      "sentences": [
        "We all love gaming controllers such as those from XBox or PlayStation so we thought, why not have one of those in our pocket?",
        "That is the reason why we have created a portable controller that allows a player to play his favourite games using a smartphone.",
        "The controller receptor must be running in the target computer and it allows up to four concurrent connections, that is, four players at the same time.",
        "All a player needs is to connect to the computer using the IP address displayed in the controller receptor."
      ],
      "technologies": [
        "Java",
        "Android"
      ]
    },
    "image": "https://res.cloudinary.com/joaosilva2095/image/upload/f_auto,q_auto/v1511525135/Portfolio/projects/portablecontroller_eqlzpb.jpg",
    "links": [
      {
        "title": "Portable controller Android",
        "link": "https://joaosilva2095.keybase.pub/personal-website/portablecontroller.apk",
        "icon": "fa-android"
      },
      {
        "title": "Portable controller receptor",
        "link": "https://joaosilva2095.keybase.pub/personal-website/portablecontroller.jar",
        "icon": "fa-download"
      }
    ]
  }
]
